In [1]:
import numpy as np
import pandas as pd

# Dataframe

## creando df a partir de diccionarios


Tiene que coincidir el n√∫mero de items

In [2]:
dicc = { 'nombre' : ['Mikel', 'Laura', 'Manuel'],
         'edad': [ 25,33,44]}

In [4]:
frame = pd.DataFrame(dicc)
display(frame)

   nombre  edad
0   Mikel    25
1   Laura    33
2  Manuel    44

In [5]:
frame.index

RangeIndex(start=0, stop=3, step=1)

## Como establecer una columna como indice

In [6]:
frame.set_index(keys= 'nombre', inplace = True)
display(frame)

        edad
nombre
Mikel     25
Laura     33
Manuel    44

## como establecer un indice semantico creado por nosotros

In [7]:
dicc = { 'nombre' : ['Mikel', 'Laura', 'Manuel'],
         'edad': [ 25,33,44]}

frame = pd.DataFrame(dicc, index= ['a', 'b', 'c'])
display(frame)

   nombre  edad
a   Mikel    25
b   Laura    33
c  Manuel    44

## Como poner nombres a columnas y/o establecer columnas creadas por nosotros

In [9]:
dicc = { 'nombre' : ['Mikel', 'Laura', 'Manuel'],
         'edad': [ 25,33,44]}

frame = pd.DataFrame(dicc, columns=['Nacionalidad', 'nombre', 'Profesion', 'edad'])
display(frame)

  Nacionalidad  nombre Profesion  edad
0          NaN   Mikel       NaN    25
1          NaN   Laura       NaN    33
2          NaN  Manuel       NaN    44